Analise de Dados - Aula 01

In [49]:
import pandas as pd
from datetime import datetime

date  = datetime.now()

In [50]:
print(date)

2026-02-19 09:16:31.836263

Estamos criando uma collection de dados para gerar um Dataframe

In [51]:
dados = {
'ID':[1,2,3,4],
'Nome': ['Alice','julia','lucas', 'daniel'],
'CPF': ['529.982.247-25','168.995.350-09','453.178.287-91','714.602.380-44'],
}

Transformando a collection em um dataframe

In [52]:
dt = pd.DataFrame(dados)

Imprime na tela o dataframe

In [53]:
dt.head()

   ID    Nome             CPF
0   1   Alice  529.982.247-25
1   2   julia  168.995.350-09
2   3   lucas  453.178.287-91
3   4  daniel  714.602.380-44

Realizando tranformacao nos nomes das pessoas (UPPER)

In [54]:
dt['Nome'] = dt['Nome'].str.upper()

In [55]:
dt.head()

   ID    Nome             CPF
0   1   ALICE  529.982.247-25
1   2   JULIA  168.995.350-09
2   3   LUCAS  453.178.287-91
3   4  DANIEL  714.602.380-44

Filtrando os IDs 2,3 e 4 
<br>OBS: Sempre que for necessario realize o filtro dos dados, armazenar o resultado em uma variavel separada. Isso evita que os dodos originais se percam

In [56]:
dt_filtrado = dt[(dt['ID']>=2) & (dt['ID'] <= 4) ]

In [57]:
dt.head()

   ID    Nome             CPF
0   1   ALICE  529.982.247-25
1   2   JULIA  168.995.350-09
2   3   LUCAS  453.178.287-91
3   4  DANIEL  714.602.380-44